export const OSAKA_U_FACULTIES = [
  {
    name: "文学部",
    departments: ["人文学科"]
  },
  {
    name: "人間科学部",
    departments: ["人間科学科"]
  },
  {
    name: "外国語学部",
    departments: ["外国語学科"]
  },
  {
    name: "法学部",
    departments: ["法学科"]
  },
  {
    name: "経済学部",
    departments: ["経済学科", "経営学科"]
  },
  {
    name: "理学部",
    departments: ["数学科", "物理学科", "化学科", "生物科学科", "宇宙地球科学科"]
  },
  {
    name: "医学部",
    departments: ["医学科", "保健学科"]
  },
  {
    name: "歯学部",
    departments: ["歯学科"]
  },
  {
    name: "薬学部",
    departments: ["薬学科", "薬科学科"]
  },
  {
    name: "工学部",
    departments: [
      "応用自然科学科",
      "応用理工学科",
      "電子情報工学科",
      "環境・エネルギー工学科",
      "地球総合工学科"
    ]
  },
  {
    name: "基礎工学部",
    departments: [
      "電子物理科学科",
      "化学応用科学科",
      "システム科学科",
      "情報科学科"
    ]
  },
  {
    name: "大学院（研究科）",
    departments: [
      "文学研究科",
      "人間科学研究科",
      "法学研究科",
      "経済学研究科",
      "理学研究科",
      "医学系研究科",
      "歯学研究科",
      "薬学研究科",
      "工学研究科",
      "基礎工学研究科",
      "情報科学研究科",
      "生命機能研究科",
      "国際公共政策研究科",
      "言語文化研究科",
      "人文学研究科"
    ]
  }
] as const;

export type FacultyName = typeof OSAKA_U_FACULTIES[number]["name"];

export const OSAKA_U_CLUBS_SPORTS = [
  "体育会", "合気道部", "剣道部", "柔道部", "空手道部",
  "弓道部", "卓球部", "バレーボール部", "バドミントン部", "フェンシング部",
  "バスケットボール部", "体操部", "硬式庭球部", "ソフトテニス部", "陸上競技部",
  "硬式野球部", "準硬式野球部", "サッカー部", "ラグビー部", "ハンドボール部",
  "フィールドホッケー部", "水泳部", "ヨット部", "漕艇部", "航空部",
  "自動車部", "ライフル射撃部", "山岳部", "スキー部", "ワンダーフォーゲル部",
  "応援団", "女子卓球部", "女子バレーボール部", "女子バドミントン部", "女子ソフトテニス部",
  "釣部", "アーチェリー部", "少林寺拳法部", "アメリカンフットボール部", "ゴルフ部",
  "サイクリング部", "ボクシング部", "アイスホッケー部", "フィギュアスケート部", "探検部",
  "ソフトボール部", "スキューバダイビング部", "女子バスケットボール部", "オリエンテーリング部", "女子ハンドボール部",
  "スポーツチャンバラ部", "ラクロス部", "女子ラクロス部", "チアリーディング部", "基礎スキー部",
  "アルティメット部", "ウインドサーフィン部", "大阪大学キャップ投げサークル", "クリケットクラブ"
] as const;

export const OSAKA_U_CLUBS_CULTURE = [
  "男声合唱団", "交響楽団", "E.S.S", "将棋部", "写真部",
  "混声合唱団", "フロイントコール", "軽音楽部", "ギタークラブ", "天文同好会",
  "落語研究部", "アイセック", "古美術研究会", "アマチュア無線クラブ", "奇術研究会",
  "鉄道研究部", "マンドリンクラブ", "書道部", "コントラクトブリッジクラブ", "茶道部",
  "フォークソング同好会", "陶芸部", "生物研究会", "喜多流能楽研究会", "創作人形劇団せせくらせ",
  "舞踏研究会", "吹奏楽団", "美術部", "囲碁部", "映画研究部",
  "考古学研究会", "人権哲学研究会", "Bible Club", "法律相談部", "ボランティアサークルフロンティア",
  "SF研究会", "推理小説研究会", "第2劇場", "コンピュータクラブ", "漫画研究会",
  "アニメーション研究会", "ボードゲーム研究会", "銀簾会", "国際法学研究会", "電子技術研究会（ツールボックス）",
  "クイズ研究会（OUQS）", "劇団ちゃうかちゃわん", "阪大ピアノの会", "RPG研究会", "劇団六風館",
  "文芸部", "アカペラサークルinspiritual voices", "競技かるた会", "現代芸術を考える会", "公共政策研究会",
  "お祭りダンスサークル祭楽人", "環境サークルGECS", "フラメンコ部Al Compás", "合唱団TEMPEST", "映像制作チームOUT+V",
  "国際問題研究会", "エレクトーンサークルHANON", "ベリーダンスサークルHalaawaat", "レゴ部", "Robohan",
  "阪大競技プログラミング部「RAINBOU」", "大阪大学フォーミュラレーシングクラブ（OFRAC）", "飛行機制作研究albatross", "ミュージカルサークルみーあキャット", "学生団体Flagship"
] as const;

export const ALL_CLUBS = [...OSAKA_U_CLUBS_SPORTS, ...OSAKA_U_CLUBS_CULTURE] as const;
